szevczenko/hq_led_lamp/sdkconfig.defaults
# Target: ESP32-WROOM-32D
CONFIG_IDF_TARGET="esp32"

# Flash size — adjust once the exact module SKU is confirmed
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
